#### TransformWithBoundary Members

---

|  |
| --- |
| TransformWithBoundary Class   Constructors   Methods   Properties   See Also |

The  TransformWithBoundary  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | TransformWithBoundary | Constructs a new copy of the input TransformWithBoundary object. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  TransformWithBoundary |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetBoundary | Returns the boundary for the model space to view projection space transform. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetModelToProjectionTransform | Gets the model space to view projection space transform. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

TransformWithBoundary Class

Autodesk.Revit.DB Namespace